// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "Sincronização de Arquivo";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Cancelar";

// Text of "Next" button, used in various dialogs
"NEXT" = "Seguinte";

// Text of "Done" button, used in various dialogs
"DONE" = "OK";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Continuar";


// ------------------------
// Exception (error) window

"DESTINATION:" = "Destino:";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "Modificado:";		// Modified label - prefixes the displayed mod date
"NAME:"        = "Nome:";			// Name label - prefixes the name of the file
"SIZE:"        = "Tamanho:";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "Neste Computador";	// For iDisk
".MAC"          = "Em %@";				// For iDisk
"LOCAL_MHD"     = "Neste Computador";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "Na Rede";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "Mostrar no Finder";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "Erro de iDisk";
"MHD ERROR TITLE"   = "Erro de Sincronização da Pasta Pessoal";
"FS ERROR TITLE"    = "Erro de Sincronização de Arquivo";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "O código de erro é %d.";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "Erro do iDisk %d de %d";
"MHD ERROR COUNT%"   = "Erro de Sincronização da P. Pessoal %d de %d";
"FS ERROR COUNT%"    = "Erro de Sincronização de Arquivo %d de %d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "Há um problema ao apagar o arquivo “%@”.";
"ERROR SYNCING%"       = "Há um problema ao sincronizar o arquivo “%@”.";
"ERROR MOVING%"        = "Há um problema ao mover o arquivo “%@”.";
"ERROR ACCESSING%"     = "Há um problema ao sincronizar o arquivo “%@”.";
"DIR:ERROR DELETING%"  = "Houve um problema ao apagar a pasta “%@”.";
"DIR:ERROR SYNCING%"   = "Houve um problema ao sincronizar a pasta “%@”.";
"DIR:ERROR MOVING%"    = "Houve um problema ao mover a pasta “%@”.";
"DIR:ERROR ACCESSING%" = "Houve um problema ao sincronizar a pasta “%@”.";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "O seu iDisk está quase cheio. Não há espaço suficiente no seu iDisk para sincronizar este item.";
"MHD DSKFULERR"        = "Seu diretório pessoal está quase cheio. Não há suficiente espaço livre disponível para sincronizar este item.";
"FS DSKFULERR"         = "Seu disco está quase cheio. Não há suficiente espaço livre disponível para sincronizar este item.";
"IDISK DSKFULERR HELP" = "Há itens no seu iDisk que estão no Lixo. Para criar mais espaço disponível, esvazie o Lixo.";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "Você não tem permissão para apagar este arquivo.";
"AFPACCESSDENIED SYNC"       = "Você não tem permissão para sincronizar este arquivo.";
"DIR:AFPACCESSDENIED DELETE" = "Você não tem permissão para apagar esta pasta.";
"DIR:AFPACCESSDENIED SYNC"   = "Você não tem permissão para sincronizar esta pasta.";
"AFPACCESSDENIED HELP"       = "Você pode verificar suas permissões no painel Informações do Finder.";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "O nome deste arquivo é igual ao de outro item de seu iDisk, exceto por algumas letras maiúsculas ou minúsculas.";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "O nome deste arquivo é igual ao de outro item do seu diretório pessoal, exceto por algumas letras maiúsculas ou minúsculas.";
"FS KSFFILENAMEDIFFERSBYCASE"        = "O nome deste arquivo é igual ao de outro item de seu disco, exceto por algumas letras maiúsculas ou minúsculas.";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "O nome desta pasta é igual ao de outro item de seu iDisk, exceto por algumas letras maiúsculas ou minúsculas.";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "O nome desta pasta é igual ao de outro item do seu diretório pessoal, exceto por algumas letras maiúsculas ou minúsculas.";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "O nome desta pasta é igual ao de outro item de seu disco, exceto por algumas letras maiúsculas ou minúsculas.";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "Você deveria alterar o nome deste item para deixá-lo significativamente diferente. Por exemplo, adicione um número ao nome.";

// fBsyErr
"FSBSYERR"      = "O arquivo está em uso.";
"FSBSYERR HELP" = "O arquivo deve estar aberto em um aplicativo. Tente fechar o arquivo ou encerrar os aplicativos.";

// fLckdErr
"FLCKDERR"      = "O arquivo está bloqueado.";
"DIR:FLCKDERR"  = "A pasta está bloqueada.";
"FLCKDERR HELP" = "Você pode desbloquear o item usando o painel Informações do Finder.";

"File Not Found"      = "O arquivo não foi encontrado..";
"HELP:File Not Found" = "Talvez o arquivo tenha sido movido durante e sincronização. Tente sincronizar novamente.";

"File Name Too Long"      = "O nome do arquivo ou da pasta é muito longo.";
"HELP:File Name Too Long" = "Renomeie este item de forma que o nome seja mais curto";

"I/O Error"      = "Ocorreu um erro ao ler ou gravar o arquivo.";
"HELP:I/O Error" = "Tente novamente mais tarde.";

"Destination does not support symlinks"      = "A pasta de destino não é compatível com links simbólicos.";
"HELP:Destination does not support symlinks" = "Tente comprimir o arquivo ou a pasta primeiro.";

"Object deleted"      = "O item foi apagado antes de ser sincronizado.";
//"HELP:Object deleted" = "";

"Object created"      = "Um novo item foi criado na mesma localização que este item antes de ser sincronizado.";
//"HELP:Object created" = "";

"Object modified"     = "Este item a ser atualizado foi modificado por outro aplicativo antes de ser sincronizado.";
//"HELP:Object modified" = "";

"Network error"       = "Ocorreu um erro de rede.";
"HELP:Network error"  = "Verifique sua conexão de rede ou tente novamente mais tarde.";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "Ocorreu um problema.";					// [rdar://5231555]
"HELP:Unknown error"       = "Tente novamente mais tarde.";
"HELP-IDISK:Unknown error" = "Tente novamente mais tarde.";
"HELP-PHD:Unknown error"   = "Tente novamente mais tarde. Se o problema continuar, entre em contato com o seu administrador de rede.";

"IDISK ALMOST FULL"     = "O seu iDisk está quase cheio.";
"ALMOST FULL TRASH MSG" = "Há arquivos do seu iDisk que estão no Lixo. Para criar mais espaço disponível, esvazie o Lixo.\n\nVocê pode aumentar o tamanho do seu iDisk no painel %@ das Preferências do Sistema.";
"ALMOST FULL .MAC MSG"  = "Você pode aumentar o tamanho do seu iDisk através do painel %@ das Preferências do Sistema.";

"REVERIFICATION"      = "O arquivo foi alterado durante cada uma das útlimas %@ sincronizações.";
"REVERIFICATION HELP" = "Talvez um aplicativo esteja modificando periodicamente o arquivo. Tente fechar o arquivo ou encerrar aplicativos.";

"TOO_MANY_EAS"      = "O destino não é compatível com alguns dados contidos neste item.";
"TOO_MANY_EAS HELP" = "Tente comprimir o arquivo ou a pasta primeiro.";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "A pasta %@ somente estará disponível quando o seu iDisk estiver ativo.";
"OFFLINE FOLDER MSG" = "Para acessar esta pasta é necessário conectar o seu computador à Internet.";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu bytes";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 conflito";
"%CONFLICTS" = "%d conflitos";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "\"%@\" foi modificado em ambas as localizações.";			// Name of conflicting item.
"%WHERE"                   = "Onde:%@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d de %d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-root-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "arquivo";
"FOLDER"                   = "pasta";
"PACKAGE"                  = "pacote";
"SYMLINK"                  = "symlink";
"IDISK_LOCAL_TITLE"        = "Este computador";
"IDISK_POPUP_LOCAL_TITLE"  = "Manter o arquivo neste computador";
"IDISK_POPUP_REMOTE_TITLE" = "Manter arquivo no %@";
"MHD_LOCAL_TITLE"          = "Neste Computador";
"MHD_REMOTE_TITLE"         = "Na Rede";
"MHD_POPUP_LOCAL_TITLE"    = "Manter o arquivo neste computador";
"MHD_POPUP_REMOTE_TITLE"   = "Manter o arquivo na rede";
"1_IDISK_CONFLICT"         = "Há um conflito de sincronização do iDisk.";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "Há %d conflitos de sincronização do iDisk.";			// Plural for iDisk
"1_MHD_CONFLICT"           = "Há um conflito de sincronização da pasta pessoal.";				// Singular for MHD
"%_MHD_CONFLICTS"          = "Há %d conflitos de sincronização da pasta pessoal.";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "Resolver todos os conflitos usando os arquivos de %@";
"IDISK_RESOLVE_LOCAL"      = "Resolver todos os conflitos usando os arquivos deste computador";
"IDISK_RESOLVE_BOTH"       = "Resolver todos os conflitos mantendo ambos os arquivos";
"IDISK_RESOLVE_LASTMOD"    = "Resolver todos os conflitos mantendo o arquivo com a data de modificação mais recente.";
"IDISK_RESOLVE_EXCLUDE"    = "Resolver todos os conflitos excluindo os arquivos das sincronizações futuras.";
"IDISK_RESOLVE_NONE"       = "Ignorar todos os conflitos.";
"MHD_RESOLVE_REMOTE"       = "Resolver todos os conflitos usando os arquivos da rede";
"MHD_RESOLVE_LOCAL"        = "Resolver todos os conflitos usando os arquivos deste computador";
"MHD_RESOLVE_BOTH"         = "Resolver todos os conflitos mantendo ambos os arquivos";
"MHD_RESOLVE_LASTMOD"      = "Resolver todos os conflitos mantendo o arquivo com a data de modificação mais recente.";
"MHD_RESOLVE_EXCLUDE"      = "Resolver todos os conflitos excluindo os arquivos das sincronizações futuras.";
"MHD_RESOLVE_NONE"         = "Ignorar todos os conflitos";
"MHD_CONFLICT_TITLE"       = "Conflitos de Sincronização";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "Impossível resolver todos os conflitos";
"NOT_ALL_RESOLVED_MSG"   = "Alguns conflitos não puderam ser resolvidos porque suas datas de modificação estão muito próximas. Por favor, resolva estes conflitos manualmente ou utilize uma opção diferente.";

"There are no file syncing errors or conflicts." = "Não há erros ou conflitos de sincronização de arquivos.";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "Seu iDisk não terminou a sincronização. Tente novamente mais tarde.";
"GLOBAL-HELP-IDISK:Timeout" = "Se você continuar tendo problemas para sincronizar o seu iDisk, talvez sua conexão à Internet esteja com problemas. Tente encerrar outros aplicativos que utilizam a Internet antes de tentar novamente.";

"GLOBAL-IDISK:NetworkError"      = "Seu iDisk não terminou a sincronização.";
"GLOBAL-HELP-IDISK:NetworkError" = "Verifique sua conexão de rede ou tente novamente mais tarde.";

"GLOBAL-IDISK:RemoteBusy"      = "Seu iDisk não terminou a sincronização.";
"GLOBAL-HELP-IDISK:RemoteBusy" = "Tente novamente mais tarde.";

"GLOBAL-IDISK:UNKNOWN"      = "Seu iDisk não terminou a sincronização porque ocorreu um problema.";
"GLOBAL-HELP-IDISK:UNKNOWN" = "Tente novamente mais tarde.";

// PHD
"GLOBAL-PHD:Timeout"      = "Seu diiretório pessoal não terminou a sincronização. Tente novamente mais tarde.";
"GLOBAL-HELP-PHD:Timeout" = "Se você continuar tendo problemas para sincronizar o seu diretório pessoal, talvez sua conexão de rede esteja com problemas. Tente encerrar outros aplicativos que utilizam a rede antes de tentar novamente.";

"GLOBAL-PHD:NetworkError"      = "Seu diretório pessoal não terminou a sincronização.";
"GLOBAL-HELP-PHD:NetworkError" = "Verifique sua conexão de rede ou tente novamente mais tarde.";

"GLOBAL-PHD:RemoteBusy"      = "Seu diretório pessoal não terminou a sincronização.";
"GLOBAL-HELP-PHD:RemoteBusy" = "Tente novamente mais tarde.";

"GLOBAL-PHD:UNKNOWN"      = "Seu diretório pessoal não terminou a sincronização porque ocorreu um problema. ";
"GLOBAL-HELP-PHD:UNKNOWN" = "Tente novamente mais tarde.";

// Other
"GLOBAL-FS:Timeout"      = "Seus arquivos não terminaram a sincronização. Tente novamente mais tarde.";
"GLOBAL-HELP-FS:Timeout" = "Se você continuar tendo problemas para sincronizar os seus arquivos, talvez sua conexão de rede esteja com problemas. Tente encerrar outros aplicativos que utilizam a rede antes de tentar novamente.";

"GLOBAL-FS:NetworkError"      = "Seus arquivos não terminaram a sincronização.";
"GLOBAL-HELP-FS:NetworkError" = "Verifique sua conexão de rede ou tente novamente mais tarde.";

"GLOBAL-FS:RemoteBusy"      = "Seus arquivos não terminaram a sincronização.";
"GLOBAL-HELP-FS:RemoteBusy" = "Tente novamente mais tarde.";

"GLOBAL-FS:UNKNOWN"      = "Seus arquivos não terminaram a sincronização porque ocorreu um problema.";
"GLOBAL-HELP-FS:UNKNOWN" = "Tente novamente mais tarde.";
